import pandas as pd

from datetime import date
from 工具 import 获取股票数据, 获取股票信息
'''
策略解释:
- 标的: 最新市值 > 500亿
- 上升: MA5 > MA10 > MA30 > MA60
- 买入点: 连续上升 N 天后的一天
- 买入策略: 买入点的开盘价半仓, 买入点的收盘价半仓, 只要是买入点都买
- 卖出策略: T+1如果浮盈则卖出，否则T+2卖出
- 总盈亏: 每笔完成的交易的盈亏比累计(每个股平均仓)

优化点:
- 买入策略:
  - 如果完成交易行，信号仍然有效，是否继续买入
  - 总仓有限，需要按照可使用的资金，和机会窗口来执行买入

'''

市值阈值 = 50_000_000_000
股票信息 = 获取股票信息(沪深 = True)
数据缓存 = {}

def 获取数据(代号):
  return 数据缓存.get(代号, 获取股票数据(代号))

def 日期转字符(date: date):
  return date.strftime('%Y-%m-%d')

def 模拟(目标日期, 市值阈值, 上升确认天数):
  总盈亏 = 0
  for 代号, 信息 in 股票信息.items():
    市值 = 信息['总市值']
    if 市值 < 市值阈值:
      continue
    数据 = 获取数据(代号).copy()
    数据 = 数据[数据['日期'] >= 目标日期]
    数据['上升'] =  数据.apply(lambda x: x['MA5'] >= x['MA10'] >= x['MA30'] >= x['MA60'], axis=1).astype(int)


    连续上升 = 数据['上升'].rolling(window=上升确认天数).mean() == 1
    连续信号开始 = 连续上升 & (连续上升.shift(1) != True)
    数据['连续信号开始'] = 连续信号开始
    数据['买入信号'] = 连续信号开始.shift(1) == True


    目标数据 = 数据[数据['买入信号']]
    if 目标数据.empty:
      continue

    盈亏 = [0]
    买入成本 = 0
    持股天数 = 0
    for i, x in 数据.iterrows():
      if 买入成本:
        持股天数 += 1
        浮盈亏 = (x['收盘'] - 买入成本) / 买入成本
        if 持股天数 == 1 and 浮盈亏 < 0:
          continue
        盈亏.append(浮盈亏)
        买入成本 = 0
      elif x['买入信号']:
        买入成本 = (x['开盘'] + x['收盘'])/ 2
        持股天数 = 0

    盈亏 = round(sum(盈亏) * 100, 2)
    总盈亏+=盈亏

    # print({'代号': 代号, '公司': 信息['name'], '上升波段数量': len(目标数据), '盈亏': 盈亏 })
    # print({'代号': 代号, '公司': 信息['name'], '日期': [x for x in 目标数据['日期'].apply(日期转字符)], '上升波段数量': len(目标数据), '盈亏': 盈亏 })

  print(f'{日期转字符(目标日期)}开始有上升波段的股票(市值>{市值阈值},上升确认天数={上升确认天数}) - 总盈亏: {round(总盈亏, 2)}')


# 今年以来的不同月份进场的测试结果
# 2024-01-01开始有上升波段的股票(市值>50000000000,上升确认天数=1) - 总盈亏: 106.26
# 2024-01-01开始有上升波段的股票(市值>50000000000,上升确认天数=2) - 总盈亏: -1.23
# 2024-01-01开始有上升波段的股票(市值>50000000000,上升确认天数=3) - 总盈亏: 16.32
# 2024-01-01开始有上升波段的股票(市值>50000000000,上升确认天数=4) - 总盈亏: 110.52
# 2024-01-01开始有上升波段的股票(市值>50000000000,上升确认天数=5) - 总盈亏: 196.2
# 2024-01-01开始有上升波段的股票(市值>50000000000,上升确认天数=6) - 总盈亏: 258.82


# 2024-02-01开始有上升波段的股票(市值>50000000000,上升确认天数=1) - 总盈亏: 244.53
# 2024-02-01开始有上升波段的股票(市值>50000000000,上升确认天数=2) - 总盈亏: 100.7
# 2024-02-01开始有上升波段的股票(市值>50000000000,上升确认天数=3) - 总盈亏: -15.19
# 2024-02-01开始有上升波段的股票(市值>50000000000,上升确认天数=4) - 总盈亏: 128.4
# 2024-02-01开始有上升波段的股票(市值>50000000000,上升确认天数=5) - 总盈亏: 233.38
# 2024-02-01开始有上升波段的股票(市值>50000000000,上升确认天数=6) - 总盈亏: 310.07


# 2024-03-01开始有上升波段的股票(市值>50000000000,上升确认天数=1) - 总盈亏: 89.7
# 2024-03-01开始有上升波段的股票(市值>50000000000,上升确认天数=2) - 总盈亏: -80.02
# 2024-03-01开始有上升波段的股票(市值>50000000000,上升确认天数=3) - 总盈亏: -44.92
# 2024-03-01开始有上升波段的股票(市值>50000000000,上升确认天数=4) - 总盈亏: 83.77
# 2024-03-01开始有上升波段的股票(市值>50000000000,上升确认天数=5) - 总盈亏: 52.58
# 2024-03-01开始有上升波段的股票(市值>50000000000,上升确认天数=6) - 总盈亏: 60.03


# 2024-04-01开始有上升波段的股票(市值>50000000000,上升确认天数=1) - 总盈亏: 92.9
# 2024-04-01开始有上升波段的股票(市值>50000000000,上升确认天数=2) - 总盈亏: -30.21
# 2024-04-01开始有上升波段的股票(市值>50000000000,上升确认天数=3) - 总盈亏: -1.73
# 2024-04-01开始有上升波段的股票(市值>50000000000,上升确认天数=4) - 总盈亏: 96.85
# 2024-04-01开始有上升波段的股票(市值>50000000000,上升确认天数=5) - 总盈亏: 150.57
# 2024-04-01开始有上升波段的股票(市值>50000000000,上升确认天数=6) - 总盈亏: 162.38


# 2024-05-01开始有上升波段的股票(市值>50000000000,上升确认天数=1) - 总盈亏: 16.16
# 2024-05-01开始有上升波段的股票(市值>50000000000,上升确认天数=2) - 总盈亏: 49.54
# 2024-05-01开始有上升波段的股票(市值>50000000000,上升确认天数=3) - 总盈亏: 87.18
# 2024-05-01开始有上升波段的股票(市值>50000000000,上升确认天数=4) - 总盈亏: 96.31
# 2024-05-01开始有上升波段的股票(市值>50000000000,上升确认天数=5) - 总盈亏: 43.4
# 2024-05-01开始有上升波段的股票(市值>50000000000,上升确认天数=6) - 总盈亏: -10.28

# 不同年入场的测试结果
# 2024-01-01开始有上升波段的股票(市值>50000000000,上升确认天数=1) - 总盈亏: 106.26
# 2024-01-01开始有上升波段的股票(市值>50000000000,上升确认天数=2) - 总盈亏: -1.23
# 2024-01-01开始有上升波段的股票(市值>50000000000,上升确认天数=3) - 总盈亏: 16.32
# 2024-01-01开始有上升波段的股票(市值>50000000000,上升确认天数=4) - 总盈亏: 110.52
# 2024-01-01开始有上升波段的股票(市值>50000000000,上升确认天数=5) - 总盈亏: 196.2
# 2024-01-01开始有上升波段的股票(市值>50000000000,上升确认天数=6) - 总盈亏: 258.82

# 2023-01-01开始有上升波段的股票(市值>50000000000,上升确认天数=1) - 总盈亏: 336.77
# 2023-01-01开始有上升波段的股票(市值>50000000000,上升确认天数=2) - 总盈亏: 112.68
# 2023-01-01开始有上升波段的股票(市值>50000000000,上升确认天数=3) - 总盈亏: 105.5
# 2023-01-01开始有上升波段的股票(市值>50000000000,上升确认天数=4) - 总盈亏: 265.4
# 2023-01-01开始有上升波段的股票(市值>50000000000,上升确认天数=5) - 总盈亏: 361.72
# 2023-01-01开始有上升波段的股票(市值>50000000000,上升确认天数=6) - 总盈亏: 442.53

# 2022-01-01开始有上升波段的股票(市值>50000000000,上升确认天数=1) - 总盈亏: -106.39
# 2022-01-01开始有上升波段的股票(市值>50000000000,上升确认天数=2) - 总盈亏: -76.22
# 2022-01-01开始有上升波段的股票(市值>50000000000,上升确认天数=3) - 总盈亏: -28.56
# 2022-01-01开始有上升波段的股票(市值>50000000000,上升确认天数=4) - 总盈亏: 354.28
# 2022-01-01开始有上升波段的股票(市值>50000000000,上升确认天数=5) - 总盈亏: 466.61
# 2022-01-01开始有上升波段的股票(市值>50000000000,上升确认天数=6) - 总盈亏: 358.69

# 2021-01-01开始有上升波段的股票(市值>50000000000,上升确认天数=1) - 总盈亏: 81.5
# 2021-01-01开始有上升波段的股票(市值>50000000000,上升确认天数=2) - 总盈亏: 90.36
# 2021-01-01开始有上升波段的股票(市值>50000000000,上升确认天数=3) - 总盈亏: 245.93
# 2021-01-01开始有上升波段的股票(市值>50000000000,上升确认天数=4) - 总盈亏: 683.56
# 2021-01-01开始有上升波段的股票(市值>50000000000,上升确认天数=5) - 总盈亏: 581.63
# 2021-01-01开始有上升波段的股票(市值>50000000000,上升确认天数=6) - 总盈亏: 442.56